----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 768, 7, 7]       2,360,064
          Identity-2              [-1, 49, 768]               0
        PatchEmbed-3              [-1, 49, 768]               0
           Dropout-4              [-1, 50, 768]               0
          Identity-5              [-1, 50, 768]               0
          Identity-6              [-1, 50, 768]               0
         LayerNorm-7              [-1, 50, 768]           1,536
            Linear-8             [-1, 50, 2304]       1,771,776
          Identity-9           [-1, 12, 50, 64]               0
         Identity-10           [-1, 12, 50, 64]               0
           Linear-11              [-1, 50, 768]         590,592
          Dropout-12              [-1, 50, 768]               0
        Attention-13              [-1, 50, 768]               0
         Identity-14              [-1, 50, 768]               0
         Identity-15              [-1, 50, 768]               0
        LayerNorm-16              [-1, 50, 768]           1,536
           Linear-17             [-1, 50, 3072]       2,362,368
             GELU-18             [-1, 50, 3072]               0
          Dropout-19             [-1, 50, 3072]               0
         Identity-20             [-1, 50, 3072]               0
           Linear-21              [-1, 50, 768]       2,360,064
          Dropout-22              [-1, 50, 768]               0
              Mlp-23              [-1, 50, 768]               0
         Identity-24              [-1, 50, 768]               0
         Identity-25              [-1, 50, 768]               0
            Block-26              [-1, 50, 768]               0
        LayerNorm-27              [-1, 50, 768]           1,536
           Linear-28             [-1, 50, 2304]       1,771,776
         Identity-29           [-1, 12, 50, 64]               0
         Identity-30           [-1, 12, 50, 64]               0
           Linear-31              [-1, 50, 768]         590,592
          Dropout-32              [-1, 50, 768]               0
        Attention-33              [-1, 50, 768]               0
         Identity-34              [-1, 50, 768]               0
         Identity-35              [-1, 50, 768]               0
        LayerNorm-36              [-1, 50, 768]           1,536
           Linear-37             [-1, 50, 3072]       2,362,368
             GELU-38             [-1, 50, 3072]               0
          Dropout-39             [-1, 50, 3072]               0
         Identity-40             [-1, 50, 3072]               0
           Linear-41              [-1, 50, 768]       2,360,064
          Dropout-42              [-1, 50, 768]               0
              Mlp-43              [-1, 50, 768]               0
         Identity-44              [-1, 50, 768]               0
         Identity-45              [-1, 50, 768]               0
            Block-46              [-1, 50, 768]               0
        LayerNorm-47              [-1, 50, 768]           1,536
           Linear-48             [-1, 50, 2304]       1,771,776
         Identity-49           [-1, 12, 50, 64]               0
         Identity-50           [-1, 12, 50, 64]               0
           Linear-51              [-1, 50, 768]         590,592
          Dropout-52              [-1, 50, 768]               0
        Attention-53              [-1, 50, 768]               0
         Identity-54              [-1, 50, 768]               0
         Identity-55              [-1, 50, 768]               0
        LayerNorm-56              [-1, 50, 768]           1,536
           Linear-57             [-1, 50, 3072]       2,362,368
             GELU-58             [-1, 50, 3072]               0
          Dropout-59             [-1, 50, 3072]               0
         Identity-60             [-1, 50, 3072]               0
           Linear-61              [-1, 50, 768]       2,360,064
          Dropout-62              [-1, 50, 768]               0
              Mlp-63              [-1, 50, 768]               0
         Identity-64              [-1, 50, 768]               0
         Identity-65              [-1, 50, 768]               0
            Block-66              [-1, 50, 768]               0
        LayerNorm-67              [-1, 50, 768]           1,536
           Linear-68             [-1, 50, 2304]       1,771,776
         Identity-69           [-1, 12, 50, 64]               0
         Identity-70           [-1, 12, 50, 64]               0
           Linear-71              [-1, 50, 768]         590,592
          Dropout-72              [-1, 50, 768]               0
        Attention-73              [-1, 50, 768]               0
         Identity-74              [-1, 50, 768]               0
         Identity-75              [-1, 50, 768]               0
        LayerNorm-76              [-1, 50, 768]           1,536
           Linear-77             [-1, 50, 3072]       2,362,368
             GELU-78             [-1, 50, 3072]               0
          Dropout-79             [-1, 50, 3072]               0
         Identity-80             [-1, 50, 3072]               0
           Linear-81              [-1, 50, 768]       2,360,064
          Dropout-82              [-1, 50, 768]               0
              Mlp-83              [-1, 50, 768]               0
         Identity-84              [-1, 50, 768]               0
         Identity-85              [-1, 50, 768]               0
            Block-86              [-1, 50, 768]               0
        LayerNorm-87              [-1, 50, 768]           1,536
           Linear-88             [-1, 50, 2304]       1,771,776
         Identity-89           [-1, 12, 50, 64]               0
         Identity-90           [-1, 12, 50, 64]               0
           Linear-91              [-1, 50, 768]         590,592
          Dropout-92              [-1, 50, 768]               0
        Attention-93              [-1, 50, 768]               0
         Identity-94              [-1, 50, 768]               0
         Identity-95              [-1, 50, 768]               0
        LayerNorm-96              [-1, 50, 768]           1,536
           Linear-97             [-1, 50, 3072]       2,362,368
             GELU-98             [-1, 50, 3072]               0
          Dropout-99             [-1, 50, 3072]               0
        Identity-100             [-1, 50, 3072]               0
          Linear-101              [-1, 50, 768]       2,360,064
         Dropout-102              [-1, 50, 768]               0
             Mlp-103              [-1, 50, 768]               0
        Identity-104              [-1, 50, 768]               0
        Identity-105              [-1, 50, 768]               0
           Block-106              [-1, 50, 768]               0
       LayerNorm-107              [-1, 50, 768]           1,536
          Linear-108             [-1, 50, 2304]       1,771,776
        Identity-109           [-1, 12, 50, 64]               0
        Identity-110           [-1, 12, 50, 64]               0
          Linear-111              [-1, 50, 768]         590,592
         Dropout-112              [-1, 50, 768]               0
       Attention-113              [-1, 50, 768]               0
        Identity-114              [-1, 50, 768]               0
        Identity-115              [-1, 50, 768]               0
       LayerNorm-116              [-1, 50, 768]           1,536
          Linear-117             [-1, 50, 3072]       2,362,368
            GELU-118             [-1, 50, 3072]               0
         Dropout-119             [-1, 50, 3072]               0
        Identity-120             [-1, 50, 3072]               0
          Linear-121              [-1, 50, 768]       2,360,064
         Dropout-122              [-1, 50, 768]               0
             Mlp-123              [-1, 50, 768]               0
        Identity-124              [-1, 50, 768]               0
        Identity-125              [-1, 50, 768]               0
           Block-126              [-1, 50, 768]               0
       LayerNorm-127              [-1, 50, 768]           1,536
          Linear-128             [-1, 50, 2304]       1,771,776
        Identity-129           [-1, 12, 50, 64]               0
        Identity-130           [-1, 12, 50, 64]               0
          Linear-131              [-1, 50, 768]         590,592
         Dropout-132              [-1, 50, 768]               0
       Attention-133              [-1, 50, 768]               0
        Identity-134              [-1, 50, 768]               0
        Identity-135              [-1, 50, 768]               0
       LayerNorm-136              [-1, 50, 768]           1,536
          Linear-137             [-1, 50, 3072]       2,362,368
            GELU-138             [-1, 50, 3072]               0
         Dropout-139             [-1, 50, 3072]               0
        Identity-140             [-1, 50, 3072]               0
          Linear-141              [-1, 50, 768]       2,360,064
         Dropout-142              [-1, 50, 768]               0
             Mlp-143              [-1, 50, 768]               0
        Identity-144              [-1, 50, 768]               0
        Identity-145              [-1, 50, 768]               0
           Block-146              [-1, 50, 768]               0
       LayerNorm-147              [-1, 50, 768]           1,536
          Linear-148             [-1, 50, 2304]       1,771,776
        Identity-149           [-1, 12, 50, 64]               0
        Identity-150           [-1, 12, 50, 64]               0
          Linear-151              [-1, 50, 768]         590,592
         Dropout-152              [-1, 50, 768]               0
       Attention-153              [-1, 50, 768]               0
        Identity-154              [-1, 50, 768]               0
        Identity-155              [-1, 50, 768]               0
       LayerNorm-156              [-1, 50, 768]           1,536
          Linear-157             [-1, 50, 3072]       2,362,368
            GELU-158             [-1, 50, 3072]               0
         Dropout-159             [-1, 50, 3072]               0
        Identity-160             [-1, 50, 3072]               0
          Linear-161              [-1, 50, 768]       2,360,064
         Dropout-162              [-1, 50, 768]               0
             Mlp-163              [-1, 50, 768]               0
        Identity-164              [-1, 50, 768]               0
        Identity-165              [-1, 50, 768]               0
           Block-166              [-1, 50, 768]               0
       LayerNorm-167              [-1, 50, 768]           1,536
          Linear-168             [-1, 50, 2304]       1,771,776
        Identity-169           [-1, 12, 50, 64]               0
        Identity-170           [-1, 12, 50, 64]               0
          Linear-171              [-1, 50, 768]         590,592
         Dropout-172              [-1, 50, 768]               0
       Attention-173              [-1, 50, 768]               0
        Identity-174              [-1, 50, 768]               0
        Identity-175              [-1, 50, 768]               0
       LayerNorm-176              [-1, 50, 768]           1,536
          Linear-177             [-1, 50, 3072]       2,362,368
            GELU-178             [-1, 50, 3072]               0
         Dropout-179             [-1, 50, 3072]               0
        Identity-180             [-1, 50, 3072]               0
          Linear-181              [-1, 50, 768]       2,360,064
         Dropout-182              [-1, 50, 768]               0
             Mlp-183              [-1, 50, 768]               0
        Identity-184              [-1, 50, 768]               0
        Identity-185              [-1, 50, 768]               0
           Block-186              [-1, 50, 768]               0
       LayerNorm-187              [-1, 50, 768]           1,536
          Linear-188             [-1, 50, 2304]       1,771,776
        Identity-189           [-1, 12, 50, 64]               0
        Identity-190           [-1, 12, 50, 64]               0
          Linear-191              [-1, 50, 768]         590,592
         Dropout-192              [-1, 50, 768]               0
       Attention-193              [-1, 50, 768]               0
        Identity-194              [-1, 50, 768]               0
        Identity-195              [-1, 50, 768]               0
       LayerNorm-196              [-1, 50, 768]           1,536
          Linear-197             [-1, 50, 3072]       2,362,368
            GELU-198             [-1, 50, 3072]               0
         Dropout-199             [-1, 50, 3072]               0
        Identity-200             [-1, 50, 3072]               0
          Linear-201              [-1, 50, 768]       2,360,064
         Dropout-202              [-1, 50, 768]               0
             Mlp-203              [-1, 50, 768]               0
        Identity-204              [-1, 50, 768]               0
        Identity-205              [-1, 50, 768]               0
           Block-206              [-1, 50, 768]               0
       LayerNorm-207              [-1, 50, 768]           1,536
          Linear-208             [-1, 50, 2304]       1,771,776
        Identity-209           [-1, 12, 50, 64]               0
        Identity-210           [-1, 12, 50, 64]               0
          Linear-211              [-1, 50, 768]         590,592
         Dropout-212              [-1, 50, 768]               0
       Attention-213              [-1, 50, 768]               0
        Identity-214              [-1, 50, 768]               0
        Identity-215              [-1, 50, 768]               0
       LayerNorm-216              [-1, 50, 768]           1,536
          Linear-217             [-1, 50, 3072]       2,362,368
            GELU-218             [-1, 50, 3072]               0
         Dropout-219             [-1, 50, 3072]               0
        Identity-220             [-1, 50, 3072]               0
          Linear-221              [-1, 50, 768]       2,360,064
         Dropout-222              [-1, 50, 768]               0
             Mlp-223              [-1, 50, 768]               0
        Identity-224              [-1, 50, 768]               0
        Identity-225              [-1, 50, 768]               0
           Block-226              [-1, 50, 768]               0
       LayerNorm-227              [-1, 50, 768]           1,536
          Linear-228             [-1, 50, 2304]       1,771,776
        Identity-229           [-1, 12, 50, 64]               0
        Identity-230           [-1, 12, 50, 64]               0
          Linear-231              [-1, 50, 768]         590,592
         Dropout-232              [-1, 50, 768]               0
       Attention-233              [-1, 50, 768]               0
        Identity-234              [-1, 50, 768]               0
        Identity-235              [-1, 50, 768]               0
       LayerNorm-236              [-1, 50, 768]           1,536
          Linear-237             [-1, 50, 3072]       2,362,368
            GELU-238             [-1, 50, 3072]               0
         Dropout-239             [-1, 50, 3072]               0
        Identity-240             [-1, 50, 3072]               0
          Linear-241              [-1, 50, 768]       2,360,064
         Dropout-242              [-1, 50, 768]               0
             Mlp-243              [-1, 50, 768]               0
        Identity-244              [-1, 50, 768]               0
        Identity-245              [-1, 50, 768]               0
           Block-246              [-1, 50, 768]               0
       LayerNorm-247              [-1, 50, 768]           1,536
        Identity-248                  [-1, 768]               0
         Dropout-249                  [-1, 768]               0
          Linear-250                   [-1, 19]          14,611
================================================================
Total params: 87,430,675
Trainable params: 87,430,675
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.66
Forward/backward pass size (MB): 121.58
Params size (MB): 333.52
Estimated Total Size (MB): 455.76
----------------------------------------------------------------
