----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 120, 120]           6,976
       BatchNorm2d-2         [-1, 64, 120, 120]             128
              ReLU-3         [-1, 64, 120, 120]               0
            Conv2d-4         [-1, 64, 120, 120]          36,864
       BatchNorm2d-5         [-1, 64, 120, 120]             128
              ReLU-6         [-1, 64, 120, 120]               0
            Conv2d-7         [-1, 64, 120, 120]          36,864
       BatchNorm2d-8         [-1, 64, 120, 120]             128
              ReLU-9         [-1, 64, 120, 120]               0
    ResidualBlock-10         [-1, 64, 120, 120]               0
           Conv2d-11        [-1, 128, 120, 120]          73,856
      BatchNorm2d-12        [-1, 128, 120, 120]             256
             ReLU-13        [-1, 128, 120, 120]               0
           Conv2d-14        [-1, 128, 120, 120]         147,456
      BatchNorm2d-15        [-1, 128, 120, 120]             256
             ReLU-16        [-1, 128, 120, 120]               0
           Conv2d-17        [-1, 128, 120, 120]         147,456
      BatchNorm2d-18        [-1, 128, 120, 120]             256
             ReLU-19        [-1, 128, 120, 120]               0
    ResidualBlock-20        [-1, 128, 120, 120]               0
AdaptiveAvgPool2d-21            [-1, 128, 1, 1]               0
           Conv2d-22              [-1, 8, 1, 1]           1,032
             ReLU-23              [-1, 8, 1, 1]               0
          Dropout-24              [-1, 8, 1, 1]               0
           Conv2d-25            [-1, 128, 1, 1]           1,152
          Sigmoid-26            [-1, 128, 1, 1]               0
               SE-27        [-1, 128, 120, 120]               0
           Conv2d-28          [-1, 256, 60, 60]         295,168
      BatchNorm2d-29          [-1, 256, 60, 60]             512
             ReLU-30          [-1, 256, 60, 60]               0
           Conv2d-31          [-1, 256, 60, 60]         589,824
      BatchNorm2d-32          [-1, 256, 60, 60]             512
             ReLU-33          [-1, 256, 60, 60]               0
           Conv2d-34          [-1, 256, 60, 60]         589,824
      BatchNorm2d-35          [-1, 256, 60, 60]             512
             ReLU-36          [-1, 256, 60, 60]               0
    ResidualBlock-37          [-1, 256, 60, 60]               0
AdaptiveAvgPool2d-38            [-1, 256, 1, 1]               0
           Conv2d-39             [-1, 16, 1, 1]           4,112
             ReLU-40             [-1, 16, 1, 1]               0
           Conv2d-41            [-1, 256, 1, 1]           4,352
AdaptiveMaxPool2d-42            [-1, 256, 1, 1]               0
           Conv2d-43             [-1, 16, 1, 1]           4,112
             ReLU-44             [-1, 16, 1, 1]               0
           Conv2d-45            [-1, 256, 1, 1]           4,352
          Sigmoid-46            [-1, 256, 1, 1]               0
 ChannelAttention-47          [-1, 256, 60, 60]               0
           Conv2d-48          [-1, 512, 30, 30]       1,180,160
      BatchNorm2d-49          [-1, 512, 30, 30]           1,024
             ReLU-50          [-1, 512, 30, 30]               0
           Conv2d-51          [-1, 512, 30, 30]       2,359,296
      BatchNorm2d-52          [-1, 512, 30, 30]           1,024
             ReLU-53          [-1, 512, 30, 30]               0
           Conv2d-54          [-1, 512, 30, 30]       2,359,296
      BatchNorm2d-55          [-1, 512, 30, 30]           1,024
             ReLU-56          [-1, 512, 30, 30]               0
    ResidualBlock-57          [-1, 512, 30, 30]               0
AdaptiveAvgPool2d-58            [-1, 512, 1, 1]               0
          Flatten-59                  [-1, 512]               0
          Dropout-60                  [-1, 512]               0
           Linear-61                   [-1, 19]           9,747
================================================================
Total params: 7,857,659
Trainable params: 7,857,659
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.66
Forward/backward pass size (MB): 337.53
Params size (MB): 29.97
Estimated Total Size (MB): 368.16
----------------------------------------------------------------
