----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 120, 120]           6,976
       BatchNorm2d-2         [-1, 64, 120, 120]             128
              ReLU-3         [-1, 64, 120, 120]               0
            Conv2d-4         [-1, 64, 120, 120]          36,864
       BatchNorm2d-5         [-1, 64, 120, 120]             128
              ReLU-6         [-1, 64, 120, 120]               0
            Conv2d-7         [-1, 64, 120, 120]          36,864
       BatchNorm2d-8         [-1, 64, 120, 120]             128
              ReLU-9         [-1, 64, 120, 120]               0
    ResidualBlock-10         [-1, 64, 120, 120]               0
           Linear-11                    [-1, 4]             260
             ReLU-12                    [-1, 4]               0
           Linear-13                   [-1, 64]             320
          Sigmoid-14                   [-1, 64]               0
SpectralAttention-15         [-1, 64, 120, 120]               0
           Conv2d-16        [-1, 128, 120, 120]          73,856
      BatchNorm2d-17        [-1, 128, 120, 120]             256
             ReLU-18        [-1, 128, 120, 120]               0
           Conv2d-19        [-1, 128, 120, 120]         147,456
      BatchNorm2d-20        [-1, 128, 120, 120]             256
             ReLU-21        [-1, 128, 120, 120]               0
           Conv2d-22        [-1, 128, 120, 120]         147,456
      BatchNorm2d-23        [-1, 128, 120, 120]             256
             ReLU-24        [-1, 128, 120, 120]               0
    ResidualBlock-25        [-1, 128, 120, 120]               0
AdaptiveAvgPool2d-26            [-1, 128, 1, 1]               0
           Conv2d-27              [-1, 8, 1, 1]           1,032
             ReLU-28              [-1, 8, 1, 1]               0
          Dropout-29              [-1, 8, 1, 1]               0
           Conv2d-30            [-1, 128, 1, 1]           1,152
          Sigmoid-31            [-1, 128, 1, 1]               0
               SE-32        [-1, 128, 120, 120]               0
           Conv2d-33          [-1, 256, 60, 60]         295,168
      BatchNorm2d-34          [-1, 256, 60, 60]             512
             ReLU-35          [-1, 256, 60, 60]               0
           Conv2d-36          [-1, 256, 60, 60]         589,824
      BatchNorm2d-37          [-1, 256, 60, 60]             512
             ReLU-38          [-1, 256, 60, 60]               0
           Conv2d-39          [-1, 256, 60, 60]         589,824
      BatchNorm2d-40          [-1, 256, 60, 60]             512
             ReLU-41          [-1, 256, 60, 60]               0
    ResidualBlock-42          [-1, 256, 60, 60]               0
AdaptiveAvgPool2d-43            [-1, 256, 1, 1]               0
           Conv2d-44             [-1, 16, 1, 1]           4,112
             ReLU-45             [-1, 16, 1, 1]               0
           Conv2d-46            [-1, 256, 1, 1]           4,352
AdaptiveMaxPool2d-47            [-1, 256, 1, 1]               0
           Conv2d-48             [-1, 16, 1, 1]           4,112
             ReLU-49             [-1, 16, 1, 1]               0
           Conv2d-50            [-1, 256, 1, 1]           4,352
          Sigmoid-51            [-1, 256, 1, 1]               0
 ChannelAttention-52          [-1, 256, 60, 60]               0
AdaptiveAvgPool2d-53            [-1, 256, 1, 1]               0
           Conv1d-54               [-1, 1, 256]               3
          Sigmoid-55                  [-1, 256]               0
              ECA-56          [-1, 256, 60, 60]               0
           Conv2d-57            [-1, 1, 60, 60]              98
          Sigmoid-58            [-1, 1, 60, 60]               0
 SpatialAttention-59          [-1, 256, 60, 60]               0
           Conv2d-60          [-1, 512, 30, 30]       1,180,160
      BatchNorm2d-61          [-1, 512, 30, 30]           1,024
             ReLU-62          [-1, 512, 30, 30]               0
           Conv2d-63          [-1, 512, 30, 30]       2,359,296
      BatchNorm2d-64          [-1, 512, 30, 30]           1,024
             ReLU-65          [-1, 512, 30, 30]               0
           Conv2d-66          [-1, 512, 30, 30]       2,359,296
      BatchNorm2d-67          [-1, 512, 30, 30]           1,024
             ReLU-68          [-1, 512, 30, 30]               0
    ResidualBlock-69          [-1, 512, 30, 30]               0
AdaptiveAvgPool2d-70            [-1, 512, 1, 1]               0
           Conv1d-71               [-1, 1, 512]               3
          Sigmoid-72                  [-1, 512]               0
              ECA-73          [-1, 512, 30, 30]               0
           Linear-74                   [-1, 32]          16,416
             ReLU-75                   [-1, 32]               0
           Linear-76                  [-1, 512]          16,896
          Sigmoid-77                  [-1, 512]               0
SpectralAttention-78          [-1, 512, 30, 30]               0
           Conv2d-79            [-1, 1, 30, 30]              98
          Sigmoid-80            [-1, 1, 30, 30]               0
 SpatialAttention-81          [-1, 512, 30, 30]               0
    DualAttention-82          [-1, 512, 30, 30]               0
AdaptiveAvgPool2d-83            [-1, 512, 1, 1]               0
          Flatten-84                  [-1, 512]               0
          Dropout-85                  [-1, 512]               0
           Linear-86                   [-1, 19]           9,747
================================================================
Total params: 7,891,753
Trainable params: 7,891,753
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.66
Forward/backward pass size (MB): 372.78
Params size (MB): 30.10
Estimated Total Size (MB): 403.54
----------------------------------------------------------------
