----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 120, 120]             192
       BatchNorm2d-2         [-1, 16, 120, 120]              32
              ReLU-3         [-1, 16, 120, 120]               0
            Conv2d-4         [-1, 16, 120, 120]             144
            Conv2d-5         [-1, 32, 120, 120]             512
DepthwiseSeparableConv-6         [-1, 32, 120, 120]               0
       BatchNorm2d-7         [-1, 32, 120, 120]              64
              ReLU-8         [-1, 32, 120, 120]               0
            Conv2d-9         [-1, 32, 120, 120]           9,216
      BatchNorm2d-10         [-1, 32, 120, 120]              64
             ReLU-11         [-1, 32, 120, 120]               0
           Conv2d-12         [-1, 32, 120, 120]           9,216
      BatchNorm2d-13         [-1, 32, 120, 120]              64
             ReLU-14         [-1, 32, 120, 120]               0
    ResidualBlock-15         [-1, 32, 120, 120]               0
           Linear-16                    [-1, 2]              66
             ReLU-17                    [-1, 2]               0
           Linear-18                   [-1, 32]              96
          Sigmoid-19                   [-1, 32]               0
SpectralAttention-20         [-1, 32, 120, 120]               0
           Conv2d-21            [-1, 8, 240, 1]             256
      BatchNorm2d-22            [-1, 8, 240, 1]              16
             ReLU-23            [-1, 8, 240, 1]               0
           Conv2d-24           [-1, 32, 120, 1]             256
           Conv2d-25           [-1, 32, 120, 1]             256
CoordinateAttention-26         [-1, 32, 120, 120]               0
           Conv2d-27           [-1, 32, 60, 60]             288
           Conv2d-28           [-1, 64, 60, 60]           2,048
DepthwiseSeparableConv-29           [-1, 64, 60, 60]               0
      BatchNorm2d-30           [-1, 64, 60, 60]             128
             ReLU-31           [-1, 64, 60, 60]               0
           Conv2d-32           [-1, 64, 60, 60]          36,928
           Conv2d-33           [-1, 64, 60, 60]          36,928
           Conv2d-34           [-1, 64, 60, 60]          36,928
           Conv2d-35           [-1, 64, 60, 60]          12,352
  MultiScaleBlock-36           [-1, 64, 60, 60]               0
           Conv2d-37           [-1, 64, 60, 60]          36,864
      BatchNorm2d-38           [-1, 64, 60, 60]             128
             ReLU-39           [-1, 64, 60, 60]               0
           Conv2d-40           [-1, 64, 60, 60]          36,864
      BatchNorm2d-41           [-1, 64, 60, 60]             128
             ReLU-42           [-1, 64, 60, 60]               0
    ResidualBlock-43           [-1, 64, 60, 60]               0
AdaptiveAvgPool2d-44             [-1, 64, 1, 1]               0
           Conv1d-45                [-1, 1, 64]               3
          Sigmoid-46                   [-1, 64]               0
              ECA-47           [-1, 64, 60, 60]               0
           Conv2d-48           [-1, 64, 30, 30]             576
           Conv2d-49          [-1, 128, 30, 30]           8,192
DepthwiseSeparableConv-50          [-1, 128, 30, 30]               0
      BatchNorm2d-51          [-1, 128, 30, 30]             256
             ReLU-52          [-1, 128, 30, 30]               0
           Conv2d-53          [-1, 128, 30, 30]         147,584
           Conv2d-54          [-1, 128, 30, 30]         147,584
           Conv2d-55          [-1, 128, 30, 30]         147,584
           Conv2d-56          [-1, 128, 30, 30]          49,280
  MultiScaleBlock-57          [-1, 128, 30, 30]               0
           Conv2d-58          [-1, 128, 30, 30]         147,456
      BatchNorm2d-59          [-1, 128, 30, 30]             256
             ReLU-60          [-1, 128, 30, 30]               0
           Conv2d-61          [-1, 128, 30, 30]         147,456
      BatchNorm2d-62          [-1, 128, 30, 30]             256
             ReLU-63          [-1, 128, 30, 30]               0
    ResidualBlock-64          [-1, 128, 30, 30]               0
AdaptiveAvgPool2d-65            [-1, 128, 1, 1]               0
           Conv2d-66              [-1, 8, 1, 1]           1,032
             ReLU-67              [-1, 8, 1, 1]               0
          Dropout-68              [-1, 8, 1, 1]               0
           Conv2d-69            [-1, 128, 1, 1]           1,152
          Sigmoid-70            [-1, 128, 1, 1]               0
               SE-71          [-1, 128, 30, 30]               0
           Conv2d-72          [-1, 128, 15, 15]           1,152
           Conv2d-73          [-1, 256, 15, 15]          32,768
DepthwiseSeparableConv-74          [-1, 256, 15, 15]               0
      BatchNorm2d-75          [-1, 256, 15, 15]             512
             ReLU-76          [-1, 256, 15, 15]               0
           Conv2d-77          [-1, 256, 15, 15]         589,824
      BatchNorm2d-78          [-1, 256, 15, 15]             512
             ReLU-79          [-1, 256, 15, 15]               0
           Conv2d-80          [-1, 256, 15, 15]         589,824
      BatchNorm2d-81          [-1, 256, 15, 15]             512
             ReLU-82          [-1, 256, 15, 15]               0
    ResidualBlock-83          [-1, 256, 15, 15]               0
           Linear-84                   [-1, 16]           4,112
             ReLU-85                   [-1, 16]               0
           Linear-86                  [-1, 256]           4,352
          Sigmoid-87                  [-1, 256]               0
SpectralAttention-88          [-1, 256, 15, 15]               0
           Conv2d-89            [-1, 1, 15, 15]              98
          Sigmoid-90            [-1, 1, 15, 15]               0
 SpatialAttention-91          [-1, 256, 15, 15]               0
    DualAttention-92          [-1, 256, 15, 15]               0
AdaptiveAvgPool2d-93            [-1, 256, 1, 1]               0
          Flatten-94                  [-1, 256]               0
          Dropout-95                  [-1, 256]               0
           Linear-96                   [-1, 19]           4,883
================================================================
Total params: 2,247,250
Trainable params: 2,247,250
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.66
Forward/backward pass size (MB): 105.37
Params size (MB): 8.57
Estimated Total Size (MB): 114.60
----------------------------------------------------------------
